fonecmid-diplom.Расширение/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
</mdclass:DataProcessor>

fonecmid-diplom.Расширение/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4bcf5efc-d119-4131-835d-815195fc8c51">
  <name>ВидыДоговоровКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
  <enumValues extendedConfigurationObject="05cf7625-5d6d-4d47-80fe-ad6a90a4e195">
    <name>Покупатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom.Расширение/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="02ae4dca-90c9-4533-a8d2-45f7c925e1e1">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="56e1be80-538e-4a1a-bac3-d0265e273da1">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c7ac2c20-577c-4b41-9689-ee5f9e0b5bea">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4a45cfae-866d-46e0-8b7b-cd53f207caca">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3951295e-fb57-4233-90dd-528866e0808c">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d405f01b-78ff-426d-8b27-b0babe2bf59d">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="81456f51-5c22-4e0b-93c2-ef6f998543dc">
    <name>Услуги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="28f19144-e851-4054-8409-ddbcc0e4ecb2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7fab7720-d7bd-4002-8786-6ffa8c2bbaed">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9b517798-39a1-44eb-9dba-ffa1d1925efa">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a89a48c2-2304-4820-bd36-596a68679149">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom.Расширение/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e774faa1-e972-468e-9960-e07838851b78">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВКМ_ДатаНачалаДоговораОбслуживания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДоговораОбслуживания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаЕжемесячнойАбонентскойПлаты</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="a81d1f8d-ea75-4cec-9742-5970eceda758">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7578fe6c-f228-48d8-9c9b-2c2c261009e2">
    <name>ВидДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom.Расширение/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ВКМ_ДлительноеМассовоеСозданиеАктовРТУ(Параметры) Экспорт
	МДоговоры = Новый Массив;
	МРТУ = Новый Массив;
	Рез = Новый Структура;
	Рез.Вставить("МДоговоры", МДоговоры);
	Рез.Вставить("МРТУ", МРТУ);
	
	//Выбрать договоры

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДоговораОбслуживания <= &Дт
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговораОбслуживания >= &Дт
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И НЕ ДоговорыКонтрагентов.Ссылка В
	|		(ВЫБРАТЬ
	|			РеализацияТоваровУслуг.Договор
	|		ИЗ
	|			Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ГДЕ
	|			РеализацияТоваровУслуг.Пометкаудаления = ЛОЖЬ
	|			И РеализацияТоваровУслуг.Организация = &Организация
	|			И НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, месяц) = НАЧАЛОПЕРИОДА(&Дт, месяц))";

	Запрос.УстановитьПараметр("Дт", НачалоМесяца(Параметры.Месяц));
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);

	РезультатЗапроса = Запрос.Выполнить();

	ВДЗ = РезультатЗапроса.Выгрузить();
	ВсегоДоговоров = ВДЗ.Количество();
	Если ВсегоДоговоров = 0 Тогда
		Возврат Рез;
	КонецЕсли;
	МДоговоры =ВДЗ.ВыгрузитьКолонку("Ссылка"); 

	//Для каждого договора создать РТУ
	ОбработаноДоговоров = 0;
	Для Каждого Дог Из ВДЗ Цикл
//создать документ РТУ
		ДокОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Дата", КонецМесяца(Параметры.Месяц));
		ДанныеЗаполнения.Вставить("Организация", Параметры.Организация);
		ДанныеЗаполнения.Вставить("Договор", Дог.Ссылка);
	//@skip-check bsl-legacy-check-string-literal
		Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Дог.Ссылка, "Владелец");
		ДанныеЗаполнения.Вставить("Контрагент", Контрагент);
		ДанныеЗаполнения.Вставить("Комментарий", "Создано обработкой ВКМ_ДлительноеМассовоеСозданиеАктовРТУ");
		ДокОбъект.Заполнить(ДанныеЗаполнения);
//автозаполнить работами и обслуживанием
		ДокОбъект.ВКМ_ВыполнитьАвтозаполнение();
		Если ДокОбъект.ПроверитьЗаполнение() Тогда
			Попытка
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецПопытки;
		МРТУ.Добавить(ДокОбъект.Ссылка);
		Иначе
		МРТУ.Добавить(СтрШаблон("Ошибка создания РТУ для контрагента %1 по договору %2",Строка(Контрагент),Строка(Дог.Ссылка)));
		КонецЕсли;
		ОбработаноДоговоров = ОбработаноДоговоров + 1;
		ДлительныеОперации.СообщитьПрогресс(ОбработаноДоговоров / ВсегоДоговоров * 100);
	КонецЦикла;

	Рез.Очистить();
	Рез.Вставить("МДоговоры", МДоговоры);
	Рез.Вставить("МРТУ", МРТУ);
	Возврат Рез;
КонецФункции
#КонецОбласти
#КонецЕсли
